import PosterChainsaw from "../../assets/img/movies/ChainsawMan/poster.jpg";
import PosterEvergarden from "../../assets/img/movies/Evergarden/poster.jpg";
import PosterCentimeters from "../../assets/img/movies/Centimeters/poster.jpg";
import PosterEternity from "../../assets/img/movies/Eternity/poster.jpg";
import PosterSlayer from "../../assets/img/movies/Slayer/poster.jpg";
import PosterDrive from "../../assets/img/movies/Drive/poster.jpg";
import PosterTitan from "../../assets/img/movies/Titan/poster.jpg";
import PosterBerserk from "../../assets/img/movies/Berserk/poster.jpg";
import PosterTanya from "../../assets/img/movies/Tanya/poster.jpg";
import PosterTour from "../../assets/img/movies/Tour/poster.jpg";
import PosterGate from "../../assets/img/movies/Gate/poster.jpg";
import PosterDemon from "../../assets/img/movies/Demon/poster.jpg";
import PosterNightCall from "../../assets/img/movies/NightCall/poster.jpg"
import PosterBerserkGoldenAge from "../../assets/img/movies/BerserkGoldenAge/poster.jpg"
import PosterSK  from "../../assets/img/movies/SK8/poster.jpg"
import PosterVivy from "../../assets/img/movies/Vivy/poster.jpg"
import PosterGodzilla from "../../assets/img/movies/Godzilla/poster.jpg"
import PosterBeyond from "../../assets/img/movies/Beyond/poster.jpg"
import PosterSummerTime from "../../assets/img/movies/SummerTime/poster.jpg"
import PosterLycoris from "../../assets/img/movies/Lycoris/poster.jpg"
import PosterRedoHealer from "../../assets/img/movies/RedoHealer/poster.jpg"
import PosterKaisen from "../../assets/img/movies/Jujutsu/poster.jpg"
import PosterSAO from "../../assets/img/movies/SAO/poster.jpg"
import PosterInterspecies from "../../assets/img/movies/Interspecies/poster.jpg"
import PosterGrandBlue from "../../assets/img/movies/GrandBlue/poster.jpg"
import PosterBastard from "../../assets/img/movies/Bastard/poster.jpg"
import PosterArknights from "../../assets/img/movies/Arknights/poster.jpg"
import PosterPeterGrill from "../../assets/img/movies/PeterGrill/poster.jpg"
import PosterBleach from "../../assets/img/movies/Bleach/poster.jpg"
import PosterMushokuTensei from "../../assets/img/movies/MushokuTensei/poster.jpg"
import PosterVinlandSaga from "../../assets/img/movies/VinlandSaga/poster.jpg"
import PosterWonderEgg from "../../assets/img/movies/WonderEgg/poster.jpg"

import BgChainsaw from "../../assets/img/movies/ChainsawMan/bg.jpg";
import BgEvergarden from "../../assets/img/movies/Evergarden/bg.jpg";
import BgCentimeters from "../../assets/img/movies/Centimeters/bg.jpg";
import BgEternity from "../../assets/img/movies/Eternity/bg.jpg";
import BgSlayer from "../../assets/img/movies/Slayer/bg.jpg";
import BgDrive from "../../assets/img/movies/Drive/bg.jpg";
import BgTitan from "../../assets/img/movies/Titan/bg.jpg";
import BgBerserk from "../../assets/img/movies/Berserk/bg.jpg";
import BgTanya from "../../assets/img/movies/Tanya/bg.jpg";
import BgTour from "../../assets/img/movies/Tour/bg.jpg";
import BgGate from "../../assets/img/movies/Gate/bg.jpg";
import BgDemon from "../../assets/img/movies/Demon/bg.jpg";
import BgNightCall from "../../assets/img/movies/NightCall/bg.jpg"
import BgBerserkGoldenAge from "../../assets/img/movies/BerserkGoldenAge/bg.jpg"
import BgSK from "../../assets/img/movies/SK8/bg.jpg"
import BgVivy from "../../assets/img/movies/Vivy/bg.jpg"
import BgGodzilla from "../../assets/img/movies/Godzilla/bg.jpg"
import BgBeyond from "../../assets/img/movies/Beyond/bg.jpg"
import BgSummerTime from "../../assets/img/movies/SummerTime/bg.jpg"
import BgLycoris from "../../assets/img/movies/Lycoris/bg.jpg"
import BgRedoHealer from "../../assets/img/movies/RedoHealer/bg.jpg"
import BgKaisen from "../../assets/img/movies/Jujutsu/bg.jpg"
import BgSAO from "../../assets/img/movies/SAO/bg.jpg"
import BgInterspecies from "../../assets/img/movies/Interspecies/bg.jpg"
import BgGrandBlue from "../../assets/img/movies/GrandBlue/bg.jpg"
import BgBastard from "../../assets/img/movies/Bastard/bg.jpg"
import BgArknights from "../../assets/img/movies/Arknights/bg.jpg"
import BgPeterGrill from "../../assets/img/movies/PeterGrill/bg.jpg"
import BgBleach from "../../assets/img/movies/Bleach/bg.jpg"
import BgMushokuTensei from "../../assets/img/movies/MushokuTensei/bg.jpg"
import BgVinlandSaga from "../../assets/img/movies/VinlandSaga/bg.jpg"
import BgWonderEgg from "../../assets/img/movies/WonderEgg/bg.jpg"


const Constants = {

    movies:[
        {
            "id": 1,
            "titleEng": "Chainsaw Man",
            "titleRus": "Человек-бензопила",
            "dateRelease": "12.02.2022",
            "episodes": "7/12",
            "status": "Ongoing",
            "age": 18,
            "genres": ["Demons", "Adventure", "Supernatural", "Shounen", "Fantasy", "Action"],
            "poster": PosterChainsaw,
            "bg": BgChainsaw,
            "codec": "https://www.youtube.com/embed/v4yLeNt-kCU",
            "rate": 9.6,
            "descriptions": "Дэндзи приходится полностью изменить свою жизнь, чтобы отработать непомерные долги отца. Он становится подручным якудзы в нелегком деле уничтожения демонов. На второй план отошли не только сон и отдых, а и общение с любимой девушкой. Только дьявольский питомец-помощник Почита вносит немного разнообразия в череду кровавых будней. Теперь у Дэндзи лишь одна цель – деньги, только в них он видит шанс на освобождение. Желая быстрей получить прибыль, парень забывает об осторожности и в одной из схваток погибает. Верный Почито спасает хозяина, слившись с ним и дав способность частичного превращения в бензопилу. Переродившийся Дэндзи продолжает крушить врагов налево и направо, чем привлекает внимание Бюро общественной безопасности. Теперь вместо якудзы ему приходится выполнять поручения правительства. В этом он видит возможность возвращения к нормальной жизни, поэтому, не страшась, выступает против самых могущественных противников. Но стоит ли так рьяно сокращать количество демонов? Не накличет ли Дэндзи еще больших бед?"
        },
        {
            "id": 2,
            "titleEng": "Violet Evergarden",
            "titleRus": "Вайолет Эвергарден",
            "dateRelease": "11.01.2018",
            "episodes": "13/13",
            "status": "Finished",
            "age": 16,
            "genres": ["Drama", "Everyday Life", "Fantasy"],
            "poster": PosterEvergarden,
            "bg": BgEvergarden,
            "codec": "https://www.youtube.com/embed/6dvszbyXS-I",
            "rate": 9.3,
            "descriptions": "Супруга ученого Орланда – талантливая писательница, выпускающая романы. Однако для того, чтобы соответствовать статусу гениального творца, не достаточно владеть безграничной фантазией, так как все свои мысли автор обязан переносить на бумагу."
        },
        {
            "id": 3,
            "titleEng": "5 Centimeters Per Second",
            "titleRus": "5 сантиметров в секунду",
            "dateRelease": "03.03.2007",
            "episodes": "1/1",
            "status": "Finished",
            "age": 16,
            "genres": ["Drama","Everyday Life","Romance"],
            "poster":PosterCentimeters,
            "bg": BgCentimeters,
            "codec": "https://www.youtube.com/embed/wdM7athAem0",
            "rate": 7.7,
            "descriptions": "Такаки Тоно и Акари Синохара, два очень близких друга и одноклассника, вынуждены расстаться, когда семья Акари переезжает в маленький город Ивафуне в префектуре Тотиги из-за работы её семьи. Несмотря на разлуку, они продолжают поддерживать связь по почте. Когда Такаки узнает, что его семья переезжает на остров Танэгасима, он решает встретиться с Акари в последний раз."
        },
        {
            "id": 4,
            "titleEng": "To Your Eternity Season 2",
            "titleRus": "Для тебя, Бессмертный 2",
            "dateRelease": "23.02.2022",
            "episodes": "5/20",
            "status": "Ongoing",
            "age": 18,
            "genres": ["Drama", "Adventure", "Supernatural", "Shounen"],
            "poster": PosterEternity,
            "bg": BgEternity,
            "codec": "https://www.youtube.com/embed/TJuIVpU7FOM",
            "rate": 9.6,
            "descriptions": "Оно прибыло на Землю неизвестно откуда — возможно, по чьей-то странной прихоти. Бессмертное нечто, «лист на ветру». Сначала оно приняло форму камня, затем стало мхом и скопировало облик мёртвого животного, после чего наконец обрело сознание. Оно двигалось вперёд по заснеженным равнинам, хотя и не знало, куда направляется... И вот оно встретило человека. С тем одиноким мальчиком, что жил, а теперь, увы, умер, оно провело немного времени и вряд ли могло понять, о чём тот мечтал. Только приняв его форму, оно имело возможность узнать, каково это. Оно было камнем, было мхом, хищником, а теперь стало мальчиком. Оно умирало снова и снова, но по-настоящему умереть не могло и только страдало, пока однажды не научилось быть человеком."
        },
        {
            "id": 5,
            "titleEng": "Goblin Slayer",
            "titleRus": "Убийца Гоблинов",
            "dateRelease": "07.05.2018",
            "episodes": "12/12",
            "status": "Finished",
            "age": 18,
            "genres": ["Adventure", "Fantasy", "Action"],
            "poster": PosterSlayer,
            "bg": BgSlayer,
            "codec": "https://www.youtube.com/embed/XjV2YrrHXE0",
            "rate": 7.7,
            "descriptions": "События происходят в выдуманном мире, который очень похож на рядовую компьютерную игру, где обитают разнообразные существа и персонажи, выполняющие всевозможные задания. Сообщество новичком, где состоит главная героиня в облике жрицы, принимает решение направиться на прохождение первой миссии. Ребята выбирают максимально простую задачу, созданную специально для неопытных игроков – ликвидацию гоблинов. Но, к огромному сожалению, вместо долгожданного триумфа группу встречают сплошные неприятности и трудности."
        },
        {
            "id": 6,
            "titleEng": "Akudama Drive",
            "titleRus": "Акудама Драйв",
            "dateRelease": "03.03.2007",
            "episodes": "12/12",
            "status": "Finished",
            "age": 18,
            "genres": ["Sci-Fi", "Action"],
            "poster": PosterDrive,
            "bg": BgDrive,
            "codec": "https://www.youtube.com/embed/47QY-u0CXMo",
            "rate": 8.9,
            "descriptions": "В далекой древности между Канто и Кансаем вспыхнула война, разделившая Японию на две части. В конечном итоге Кансай проиграл и утратил самостоятельность. Постепенно его правительство и полиция стали уступать всё возрастающей преступности... Акудама — так стали называть злодеев, которые пытаются поставить мир с ног на голову."
        },
        {
            "id": 7,
            "titleEng": "Attack on Titan Final Season",
            "titleRus": "Атака титанов: Финал",
            "dateRelease": "07.12.2022",
            "episodes": "16/16",
            "status": "Finished",
            "age": 18,
            "genres": ["Military", "Detective", "Drama", "Shounen", "Super power", "Fantasy", "Action"],
            "poster": PosterTitan,
            "bg": BgTitan,
            "codec": "https://www.youtube.com/embed/EPc8ccHLIZs",
            "rate": 9.4,
            "descriptions": "За морем Марлия заканчивает длительную войну с войсками Средневосточного Альянса. Нация, всегда полагавшаяся на титанов в войне, осознает, что постепенно теряет первенство в военном противостоянии из-за наращивания другими государствами военной мощи и развития противотитанического оружия. Чтобы удержать лидирующую позицию на мировой арене, Марлии необходима сила Титана-основателя, сильнейшего из девяти изначальных титанов, способного контролировать других титанов. К несчастью для Марлии, эта сила всё ещё находится на острове Парадиз в руках Эрена Йегера. Райнеру Брауну — единственному воину, вернувшемуся после провальной операции по захвату Основателя, вновь предстоит столкнуться с бывшими товарищами."
        },
        {
            "id": 8,
            "titleEng": "Berserk",
            "titleRus": "Берсерк",
            "dateRelease": "06.02.1997",
            "episodes": "25/25",
            "status": "Finished",
            "age": 18,
            "genres": ["Military", "Demons", "Drama", "Adventure", "Romance", "Supernatural", "Seinen", "Horror", "Fantasy", "Action"],
            "poster": PosterBerserk,
            "bg": BgBerserk,
            "codec": "https://www.youtube.com/embed/enYu2Zgv0R4",
            "rate": 9.4,
            "descriptions": "Боль, кровь и слёзы. На престол восходит новый правитель. Его слуги, подручные демоны безнаказанно творят бесчинства в городе. Все меняется когда в город, скрытый темнотой ночи, попадает тяжёлый воин. С разнообразным вооружением для самых непредвиденных моментов, в броне, тело его все покрыто шрамами – черный мечник. Его меч настолько огромен, что может сравниться с его лютой злобой к королю и демонам. Эта история по сути военная драма. Происходящая в средневековье, включает в себя хоррор перемешанный с фэнтези. В центре действий Гатс, его судьба. В прошлом наёмник, а теперь он охотится за демонами. Его путь определенный свыше. Предательство, верность, магия, темные существа и эльфы."
        },
        {
            "id": 9,
            "titleEng": "The Saga of Tanya the Evil",
            "titleRus": "Военная хроника маленькой девочки",
            "dateRelease": "06.01.2017",
            "episodes": "12/12",
            "status": "Finished",
            "age": 18,
            "genres": ["Military", "Magic"],
            "poster": PosterTanya,
            "bg": BgTanya,
            "codec": "https://www.youtube.com/embed/-AHSd_tkR2A",
            "rate": 8.8,
            "descriptions": "Нужно ли верить в реинкарнацию? Есть люди, которые заверяют, что после перерождения человек утрачивает воспоминания о прежней жизни. Но данное утверждение может оспорить один японец. Ранее он трудился в фирме на должности топ-менеджера, но его путь оборвался. Мужчина точно не подозревал, что после смерти предстанет перед Творцом, так как он всегда отрицал существование Господа. Таким скептицизмом центральный персонаж сильно разгневал Бога, который решил наказать самовлюбленного землянина и отправил того в параллельный мир 1914-го года – период, когда процветала империя Великого Рейха."
        },
        {
            "id": 10,
            "titleEng": "Girls' Last Tour",
            "titleRus": "Девушки в последнем путешествии",
            "dateRelease": "03.03.2007",
            "episodes": "12/12",
            "status": "Finished",
            "age": 16,
            "genres": ["Detective", "Casual", "Adventure", "Sci-Fi"],
            "poster": PosterTour,
            "bg": BgTour,
            "codec": "https://www.youtube.com/embed/Lzw364Q-Edo",
            "rate": 8.9,
            "descriptions": "Всем событиям однажды приходит конец. Нет на Земле ничего вечного. Ежегодно появляются новые сообщения о грядущем апокалипсисе. Одни люди воспринимают странные предсказания абсолютно серьёзно, а другие просто смеются над ними, как над глупыми сказками. Но что если действительно произойдёт катастрофа? Что случится с людьми? С этими вопросами предлагает разобраться сюжетная линия анимационной картины. Наступил период, когда человеческой цивилизации приходится несладко, ведь она находится на грани полного вымирания. Огромнейшее количество людей погибло, а животная сфера потеряла свою значительную часть. Гигантские города, в которых в недалёком прошлом жили, суетились и веселились граждане, теперь изнывают от пустоты и тишины."
        },
        {
            "id": 11,
            "titleEng": "Gate: Thus the JSDF Fought There!",
            "titleRus": "Врата: Там бьются наши воины",
            "dateRelease": "12.08.2015",
            "episodes": "12/12",
            "status": "Finished",
            "age": 18,
            "genres": ["Military", "Adventure", "Fantasy", "Action"],
            "poster": PosterGate,
            "bg": BgGate,
            "codec": "https://www.youtube.com/embed/fcCJhQrGcEQ",
            "rate": 7.7,
            "descriptions": "В Гиндзе неожиданно открылись пространственные врата, и толпы врагов ринулись захватывать мир. Но к большой радости, силам Японии удалось отбить атаку противника. Оказывается, что они по-настоящему сильные и могущественные войны, и так легко не были готовы сдаваться. Прекрасно понимая, что нападения не прекратятся, они решили построить собственный гарнизон. Главным героем становится тридцати трехлетний мужчина по имени Ёдзи Итами."
        },
        {
            "id": 12,
            "titleEng": "Demon Slayer -Kimetsu no Yaiba- The Movie: Mugen Train",
            "titleRus": "Истребитель демонов: Поезд «Бесконечный»",
            "dateRelease": "16.07.2020",
            "episodes": "1/1",
            "status": "Finished",
            "age": 16,
            "genres": ["Demons", "Historical", "Supernatural", "Shounen", "Action"],
            "poster": PosterDemon,
            "bg": BgDemon,
            "codec": "https://www.youtube.com/embed/wtE-SW8YDHM",
            "rate": 9,
            "descriptions": "Завершив оздоровительные тренировки в Доме бабочки, Тандзиро и его друзья отправляются выполнять новое задание. На поезде «Бесконечный» творится что-то неладное: в одночасье там исчезает более 40 человек! А значит, Тандзиро, Нэдзуко, Иноскэ и Дзэницу предстоит сразиться с могущественным демоном. Присоединившись к одному из сильнейших мечников — пламенному столпу Кёдзюро Рэнгоку, герои бросают вызов врагу, в то время как поезд «Бесконечный» мчится в долину отчаяния…"
        },
        {
            "id": 13,
            "titleEng": "Call of the Night",
            "titleRus": "Песнь ночных сов",
            "dateRelease": "08.06.2022",
            "episodes": "13/?",
            "status": "ongoing",
            "age": 16,
            "genres": ["Vampires", "Romance", "Supernatural", "Shounen"],
            "poster": PosterNightCall,
            "bg": BgNightCall,
            "codec": "https://www.youtube.com/embed/eojyaDZ-mKA",
            "rate": 8.9,
            "descriptions": "Кто совершал ночные прогулки, наверняка, скажет, что они прекрасны. Отсутствие людей, машин и прочих раздражителей, шарм тёмного времени суток и непередаваемое чувство свободы — такая атмосфера никого не оставит равнодушным. Вот и четырнадцатилетний ученик средней школы Ко Ямори, которого мучила бессонница и который поэтому решил выйти прогуляться, был обворожён. Слоняясь по пустым улицам, парень встретил загадочную девушку по имени Надзуна Нанакуса, которая показала мальцу все прелести ночной жизни. Закончились их совместные приключения тем, что вскоре Ко уже делил футон с Надзуной, которая, решив, что паренёк заснул, взяла и укусила его за шею!"
        },
        {
            "id": 14,
            "titleEng": "Berserk: The Golden Age Arc - Memorial Edition",
            "titleRus": "Берсерк: Золотой век — Мемориальное издание",
            "dateRelease": "02.02.2022",
            "episodes": "9/?",
            "status": "Ongoing",
            "age": 18,
            "genres": ["Military", "Drama", "Adventure", "Supernatural", "Horror", "Fantasy", "Action"],
            "poster": PosterBerserkGoldenAge,
            "bg": BgBerserkGoldenAge,
            "codec": "https://www.youtube.com/embed/H6dkuEdzaFY",
            "rate": 5.8,
            "descriptions": "Отряд 'Сокол' продолжает бороться, и на этот раз Гриффит вызвался совершить невозможное: захватить бывший оплот королевства Мидлэнд. Пять тысяч всадников против тридцати тысячного гарнизона — безумие или слепая вера в мечту? Спасет ли Гатс своего лучшего друга Гриффита, чьё сердце давно поглотила тьма?..."
        },
        {
            "id": 15,
            "titleEng": "SK8 the Infinity",
            "titleRus": "SK8: На скейте в бесконечность",
            "dateRelease": "10.01.2021",
            "episodes": "12/12",
            "status": "Finished",
            "age": 12,
            "genres": ["Comedy", "Sports"],
            "poster": PosterSK,
            "bg": BgSK,
            "codec": "https://www.youtube.com/embed/eUHMO2VMolU",
            "rate": 9.4,
            "descriptions": "Рэки одержим скейтбордом. Он решает принять участие в закрытом турнире по скейтбордингу, который называется «S». Победителем турнира станет тот, кто первым спустится по опасной горной трассе. Приятель Рэки, Ланга, недавно вернувшийся из Канады, едет вместе с ним и, неожиданно для самого себя, тоже становится участником смертельно опасной гонки. Друзей ждёт встреча с сильнейшими скейтерами…"
        },
        {
            "id": 16,
            "titleEng": "Vivy -Fluorite Eye's Song",
            "titleRus": "Виви: Песнь флюоритового глаза",
            "dateRelease": "03.04.2021",
            "episodes": "13/13",
            "status": "Finished",
            "age": 18,
            "genres": ["Music", "Thriller", "Sci-Fi", "Action"],
            "poster": PosterVivy,
            "bg": BgVivy,
            "codec": "https://www.youtube.com/embed/roh_p2l8DHo",
            "rate": 9.3,
            "descriptions": "Ниаленд» — парк развлечений и выставка ИИ, где объединены мечты, надежды и наука. Там выступает первый в истории автономный ИИ-гуманоид — Виви. Её назначение — своими песнями дарить всем счастье. Чтобы исполнить его, она каждый день выходит на сцену и пытается вложить в песню душу, но слушателей у неё не прибавляется. И вот однажды перед Виви появляется ИИ по имени Мацумото. Он говорит, что пришёл из будущего, которое наступит через сто лет, и что Виви должна помочь ему изменить историю предотвратить войну между людьми и ИИ. Какое же новое будущее создаст встреча двух ИИ со разными назначениями?"
        },
        {
            "id": 17,
            "titleEng": "Godzilla Singular Point",
            "titleRus": "Годзилла: Точка сингулярности",
            "dateRelease": "04.01.2021",
            "episodes": "13/13",
            "status": "Finished",
            "age": 16,
            "genres": ["Detective", "Mecha", "Sci-Fi", "Action"],
            "poster": PosterGodzilla,
            "bg": BgGodzilla,
            "codec": "https://www.youtube.com/embed/wUhyxRbLWbk",
            "rate": 7.8,
            "descriptions": "Из морских глубин исходит беспрецедентная угроза для всего человечества. Молодые гении Мэй Камино, женщина-исследователь, и Юн Арикава, мужчина-инженер, вместе со своими товарищами должны будут разобраться в тайне сингулярной точки Годзиллы."
        },
        {
            "id": 18,
            "titleEng": "Beyond the Boundary",
            "titleRus": "За гранью",
            "dateRelease": "03.02.2013",
            "episodes": "12/12",
            "status": "Finished",
            "age": 16,
            "genres": ["Everyday life", "Supernatural", "Fantasy"],
            "poster": PosterBeyond,
            "bg": BgBeyond,
            "codec": "https://www.youtube.com/embed/Er_qT0Qo2v0",
            "rate": 8.5,
            "descriptions": "Ёму – это старинные демоны, которые находятся в духовном мире. Кое-кого из них совершенно невозможно отличить от обычного человека, а большинству просто нет абсолютно никакого дела до нас. Охотники собираются в кланы, причем, у каждого свои особенные способности и стили боя, власть и влияние в собственных сферах. Охотники, Чистильщики и Оценщики стараются действовать таким образом, чтобы не попадаться на глаза простым людям, для них отзвуки битв между могущественными магическими существами – это словно далекая гроза. Вообще, такой мир чем-то похож на наш, и в управлении им также возникает немало страстей. Именно такого мнения придерживался Акихито Канбара, ученик старших классов, когда он пытался спасти привлекательную особу по имени Мирай Курияма. Она учится в той же самой школе, что и главный герой, и она относится к уничтоженному клану, которого все вокруг презирают. Однажды она впала в сильнейшую депрессию и не хотела больше жить на этом свете. Акихито же является бессмертным полудемоном, и он даже дал ей за собой погоняться, чтобы она хоть немного выпала из стресса и апатии. Но скоро ему намекнули, что, если он свяжется с этой особой, то ему не поможет никакое бессмертие."
        },
        {
            "id": 19,
            "titleEng": "Summer Time Rendering",
            "titleRus": "Летнее время",
            "dateRelease": "15.04.2022",
            "episodes": "25/25",
            "status": "Finished",
            "age": 18,
            "genres": ["Detective", "Supernatural", "Shounen"],
            "poster": PosterSummerTime,
            "bg": BgSummerTime,
            "codec": "https://www.youtube.com/embed/CdJNaqXlCUI",
            "rate": 9.3,
            "descriptions": "Симпэй и не думал возвращаться в родной город из Токио, пока не узнал о смерти сводной сестры. И вот он стоит на причале небольшого острова — места, где провёл детство, — и с грустью вспоминает дни минувшие. Усио больше нет. Она утонула, пытаясь спасти ребёнка. Винить некого, разве что злую судьбу. Причина смерти ясна, обстоятельства указывают на несчастный случай. Однако те немногие, кто видел на теле девушки следы удушения, верят в убийство. Вдобавок среди островитян ходят дурные слухи о неких тенях — двойниках людей, которые несут смерть увидевшим их. Местные сказки, не более. Так и думал бы Симпэй, если бы его вторая сводная сестра Мио не клялась, что за три дня до смерти Усио видела точную её копию... Любопытство приводит парня к местному храму, где, согласно поверью, можно изгнать тень. Это же любопытство его и губит. Там, в лесу, он не успевает удивиться происходящему — как умирает... А затем видит странный сон о сестре и просыпается — в тот же день, когда приплыл на остров. Что, чёрт возьми, тут творится?"
        },
        {
            "id": 20,
            "titleEng": "Lycoris Recoil",
            "titleRus": "Ликорис Рикоил",
            "dateRelease": "02.7.2022",
            "episodes": "13/13",
            "status": "Finished",
            "age": 16,
            "genres": ["NaN"],
            "poster": PosterLycoris,
            "bg": BgLycoris,
            "codec": "https://www.youtube.com/embed/F5DMjhg3A6c",
            "rate": 8.8,
            "descriptions": "Эта история расскажет нам о буднях двух милых девочек. Чисато — жизнерадостная и дружелюбная, а Такину — скромная и замкнутая. У них разные привычки и мировоззрение, однако это не мешает им дружить. Они обе мечтают поступить в колледж и прикладывают все усилия для достижения цели, однако из-за своей наивности часто попадают в нелепые и забавные ситуации."
        },
        {
            "id": 21,
            "titleEng": "Redo of Healer",
            "titleRus": "Маг-целитель: Новый старт",
            "dateRelease": "13.01.2021",
            "episodes": "12/12",
            "status": "Finished",
            "age": 18,
            "genres": ["Harem", "Drama", "Magic", "Adventure", "Fantasy", "Ecchi"],
            "poster": PosterRedoHealer,
            "bg": BgRedoHealer,
            "codec": "https://www.youtube.com/embed/I9vWcvh7L3s",
            "rate": 8.4,
            "descriptions": "Вот и Кэяру, представляющему эту специализацию, не оставалось ничего другого, как раз за разом становиться инструментом для чужих побед. Так и пропадать бы ему в безвестности и депрессии, но однажды он смог заглянуть за пределы магии исцеления и увидеть её истинный потенциал. Тогда он понял, что целители, на самом деле, сильнейший класс. Вот только было уже слишком поздно — к этому времени он потерял всё, что имел. У любого на его месте опустились бы руки, но парень решил не сдаваться! Он применил исцеляющую магию ко всему миру и вернулся на четыре года назад, чтобы исправить свою жизнь. Вот теперь-то маг-целитель, вооружённый знаниями из будущего, покажет всем, кто тут в поле настоящий воин!"
        },
        {
            "id": 22,
            "titleEng": "Jujutsu Kaisen",
            "titleRus": "Магическая битва",
            "dateRelease": "03.02.2020",
            "episodes": "24/24",
            "status": "Finished",
            "age": 18,
            "genres": ["Demons", "Supernatural", "Shounen", "Horror", "Fantasy", "School", "Action"],
            "poster": PosterKaisen,
            "bg": BgKaisen,
            "codec": "https://www.youtube.com/embed/lLh4TCmkIoo",
            "rate": 9.4,
            "descriptions": "Юдзи Итадори — сильный юноша, который ведёт заурядную жизнь старшеклассника. Однажды, чтобы спасти друзей от нападения проклятий, он съедает палец Двуликого призрака, который становится частью его души. С этого момента он делит с ним своё тело. Под присмотром Сатору Годзё, одного из сильнейших магов, Итадори поступает в магический техникум, где учат сражаться с проклятиями."
        },
        {
            "id": 23,
            "titleEng": "SAO Alicization War of Underworld Part One",
            "titleRus": "Мастера Меча Онлайн: Алисизация — Война в Подмирье",
            "dateRelease": "13.02.2019",
            "episodes": "12/12",
            "status": "Finished",
            "age": 18,
            "genres": ["Games", "Adventure", "Romance", "Fantasy", "Action"],
            "poster": PosterSAO,
            "bg": BgSAO,
            "codec": "https://www.youtube.com/embed/Z7oiq9LDm8k",
            "rate": 8.8,
            "descriptions": "Полгода прошло с момента победы над Администратором. Но теперь «Underworld» грозит новая опасность — финальная фаза стресс-теста приближается с каждой секундой, и Великие Восточные Врата падут, а вместе с ними на империю Мира Людей нападут пятьдесят тысяч солдат императора Вектора с Тёмной Территории. Сможет ли выстоять пятитысячная армия Мира Людей под предводительством рыцаря всецелого Беркули?"
        },
        {
            "id": 24,
            "titleEng": "Interspecies Reviewers",
            "titleRus": "Межвидовые рецензенты",
            "dateRelease": "11.01.2020",
            "episodes": "12/12",
            "status": "Finished",
            "age": 18,
            "genres": ["Comedy", "Fantasy", "Ecchi"],
            "poster": PosterInterspecies,
            "bg": BgInterspecies,
            "codec": "https://www.youtube.com/embed/_qfbDzNqE1s",
            "rate": 9,
            "descriptions": "Понятие красоты – вещь относительная. Кому-то нравится одно, кому-то – другое. И сделать выбор в пользу той или иной красотки очень сложно, именно для таких случаев было создано сообщество межвидовых критиков, способных не предвзято судить о человеческой красоте. В него входят суккубы, циклопы, эльфы и т.д. –мифические создания, рецензиаторы, способные сильно упростить выбор самой красивой девушки. Что ж, с выбором человеческой красотки разобрались. Но кто будет оценивать эльфиек, ангелов и суккубов? Ведь в мире есть не только люди… Вопрос решился довольно просто – в организацию принимают авантюриста-человека и эльфа с весьма извращенным вкусом. Эти двое – большие поклонники женской красоты и буквально «прописаны» во всех известных борделях. Также, они постоянно друг с другом ссорятся и не могут прийти к общему мнению, кто лучше. Но оценки этих авантюристов-извращенцев очень высоко ценятся общественностью. И они с огромным рвением выставляют свои баллы красоткам… может им даже удастся прийти к согласию? А пока – путь, дорога, и множество красивых женщин на пути!"
        },
        {
            "id": 25,
            "titleEng": "Grand Blue",
            "titleRus": "Необъятный океан",
            "dateRelease": "14.06.2018",
            "episodes": "12/12",
            "status": "Finished",
            "age": 18,
            "genres": ["Comedy", "Casual", "Seinen"],
            "poster": PosterGrandBlue,
            "bg": BgGrandBlue,
            "codec": "https://www.youtube.com/embed/7ygvyKSnmkI",
            "rate": 9.5,
            "descriptions": "Сюжетная линия решает показать зрителям интересную историю о ярком солнце, теплом пляже, завораживающих пейзажах и, конечно же, компании веселых приятелей, которые не боятся погружаться в водную гладь и доверять ей собственные жизни. Конечно же, дайвингу невозможно научиться за минуту. Чтобы стать настоящим профессионалом, необходимо долго и упорно тренироваться, а еще совершенно не бояться глубины. Если нет внутренней силы и большого желания – можно смело вычеркивать себя из списка опытных специалистов. Иори Китахара поступает в университет, расположенный в прибрежном городе. Жить парнишка будет в съемной комнате у семейства Котегава. Лидер семьи является владельцем магазина, торгующего снаряжением для дайвинга. Хотя подобный нюанс абсолютно не заинтересовывает юношу, так как он с ранних лет испытывает неподдельный страх перед видом воды. Он вообще предпочитает не приближаться к объекту своего испуга. В определенный момент герой знакомится с группой приятелей-дайверов, которые вынуждают его постепенно менять своё мировоззрение. Получится ли у Иори распрощаться с имеющимися фобиями и наконец-то покорить просторы бескрайнего океана?"
        },
        {
            "id": 26,
            "titleEng": "BASTARD‼ Heavy Metal, Dark Fantasy Part 2",
            "titleRus": "Ублюдок!! Сокрушитель тьмы. Часть 2 ONA",
            "dateRelease": "15.09.2022",
            "episodes": "11/11",
            "status": "Finished",
            "age": 18,
            "genres": ["Comedy", "Adventure", "Fantasy", "Action", "Ecchi"],
            "poster": PosterBastard,
            "bg": BgBastard,
            "codec": "https://www.youtube.com/embed/Xy8HtIueLss",
            "rate": 7.7,
            "descriptions": "Некогда человечество отказалось от науки в пользу магии и оккультизма. История разворачивается вокруг группы из пяти магов, собирающихся восстановить свой мир, когда-то погружённый в хаос и почти полностью разрушенный разбушевавшимся богом. Ведомые своим лидером Дарк Шнайдером, Гара, Аршес Ней, Абигейл и Калл-Су намереваются завоевать все существующие королевства, одно за другим, в надежде построить утопический мир. При этом у каждого из них свои причины для этого. Впрочем, безрассудное поведение и вспыльчивый характер Дарк Шнайдера приводит к тому, что он приносит разрушение всюду, куда бы ни пошёл. В результате, он попадает в ловушку, подстроенную группой священников, и они запечатывают его в теле ребёнка, Луша Рэнрэна, оставив остальных четырёх магов без своего лидера. Пятнадцать лет спустя четверо магов снова начинают захват королевств, однако теперь их цель сводится к деспотичной власти над всем миром. Некогда поймавшие Дарк Шнайдера священники освобождают его, ведь только он сможет защитить их королевство от своих бывших товарищей. Теперь Дарк Шнайдеру предстоит выследить каждого из них и вернуть их всех на путь истинный, ведь и сам некогда безрассудный и аморальный Дарк Шнайдер изменился за пятнадцать лет заключения..."
        },
        {
            "id": 27,
            "titleEng": "Arknights Animation: Prelude to Dawn",
            "titleRus": "Аркнайтс: Прелюдия к рассвету",
            "dateRelease": "29.09.2022",
            "episodes": "5/8",
            "status": "Ongoing",
            "age": 16,
            "genres": ["Fantasy", "Action"],
            "poster": PosterArknights,
            "bg": BgArknights,
            "codec": "https://www.youtube.com/embed/_Q4zGuEqi8c",
            "rate": 8.4,
            "descriptions": "В мире под названиям Терра царствуют Бедствия — страшные катаклизмы неизвестной природы. Чтобы спастись от них, большинство людей живут в мобильных городах, на создание которых ушли долгие годы. После себя Бедствия оставляют загадочный минерал — оригиний, невероятный источник энергии. С одной стороны, он привёл к стремительному развитию цивилизации, с другой — принёс неизлечимую болезнь орипатию. Тела поражённых ей постепенно превращаются в кристалл, а после смерти рассыпаются в новую болезнетворную пыль. Из-за страха перед болезнью заражённых по всему миру всячески притесняют, изгоняют и отправляют на принудительные работы. Чтобы спасти человечество, фармацевтическая компания «Родос Айленд» пошла своим путём в поиске лекарства от орипатии…"
        },
        {
            "id": 28,
            "titleEng": "Peter Grill and the Philosopher's Time: Super Extra",
            "titleRus": "Питер Грилл и время мудреца 2",
            "dateRelease": "10.9.2022",
            "episodes": "8/12",
            "status": "Ongoing",
            "age": 18,
            "genres": ["Harem", "Comedy", "Fantasy", "Ecchi"],
            "poster": PosterPeterGrill,
            "bg": BgPeterGrill,
            "codec": "https://www.youtube.com/embed/5YtR-VZ90qg",
            "rate": 6.7,
            "descriptions": "Что мужчине нужно для счастья? Наверное, не так уж много: чтобы желудок был полон, любимая девушка под боком, ну и ещё, может быть, прослыть самым сильным бойцом в мире. Довольно скромные запросы, не так ли? Питер Грилл близок к счастью, как никто другой. Он уже известен по всей стране как сильнейший воин, у него есть девушка на примете, с которой он всеми способами пытается сблизиться. Можно было со всей уверенностью считать, что жизнь его удалась ровно до того момента, как до него дошло, что десятки женщин готовы бороться за его семя, чтобы произвести на свет сильное потомство."
        },
        {
            "id": 29,
            "titleEng": "Bleach: Thousand-Year Blood War",
            "titleRus": "Блич: Тысячелетняя кровавая война",
            "dateRelease": "11.09.2022",
            "episodes": "7/13",
            "status": "Ongoing",
            "age": 18,
            "genres": ["Adventure", "Fantasy", "Action"],
            "poster": PosterBleach,
            "bg": BgBleach,
            "codec": "https://www.youtube.com/embed/1sygUhb8Q2Y",
            "rate": 9.6,
            "descriptions": "Конец близок. 'Готей 13' под угрозой полного уничтожения. Старый могущественный враг всех шинигами вновь объявляет войну Обществу душ. И это не кто иной, как сами квинси, возглавляемые новым императором Ванденрейха, зовущим себя Яхве. И цель его ясна, как блеск клинка занпакто. Он хочет убить Короля душ, захватить трон и на руинах построить свою новую империю. Так пламя тысячелетней кровавой войны разгорается с новой силой, а грядущая битва потрясёт оба мира и изменит судьбы многих. Насколько тяжёлым будет это испытание? А такие ли они хорошие, эти шинигами? И какой может быть цена победы в однажды начатой войне? Придётся узнать ответ…"
        },
        {
            "id": 30,
            "titleEng": "Mushoku Tensei: Jobless Reincarnation",
            "titleRus": "Реинкарнация безработного: История о приключениях в другом мире. Часть 2",
            "dateRelease": "04.09.2022",
            "episodes": "12/12",
            "status": "Finished",
            "age": 18,
            "genres": ["Drama", "Fantasy", "Ecchi"],
            "poster": PosterMushokuTensei,
            "bg": BgMushokuTensei,
            "codec": "https://www.youtube.com/embed/keti2rbgI6c",
            "rate": 9.5,
            "descriptions": "Эта история расскажет об отаку-неудачнике, который погиб под колёсами автомобиля, а после пришёл в себя в теле новорождённого. Как оказалось, он переродился в другом мире, и теперь его зовут Рудеус Грейрат. Чтобы выжить и не повторять прошлых ошибок, Рудеус решил прилежно учиться магии и искусству владения мечом. Хотя внешний мир всё ещё пугал бывшего затворника, Рудеус нашёл в себе силы и завёл первого друга. А спустя время и сам, покинув стены родного дома, взялся за обучение несносной девчонки по имени Эрис Бореас Грейрат. Всё, казалось бы, шло как нельзя лучше, но его вместе с Эрис внезапно перебросило на другой континент. Теперь молодому магу предстоит дорога домой в компании своей ученицы Эрис и сильнейшего супарда по имени Руйджерд Супардия. Возвращение будет полным приключений, опасностей и новых знакомств, но для того, чтобы отыскать близких и выяснить, что произошло с его родным домом, Рудеус ни за что не свернёт с намеченного пути!"
        },
        {
            "id": 31,
            "titleEng": "Vinland Saga Part Two",
            "titleRus": "Сага о Винланде: Эпизод 2",
            "dateRelease": "10.01.2023",
            "episodes": undefined,
            "status": "Planned",
            "age": 18,
            "genres": ["Drama", "Historical", "Adventure", "Seinen", "Action"],
            "poster": PosterVinlandSaga,
            "bg": BgVinlandSaga,
            "codec": "https://www.youtube.com/embed/VHGotYh6hPM",
            "rate": 0.0,
            "descriptions": "Одиннадцатый век. Далёкая и холодная Исландия, окутанная морской гладью. Страна, для которой характерно не только обилие снега и северное сияние, завораживающее своей красой, но и место проживания великих воинов — викингов. Эти отважные люди, верующие в своих могущественных богов, были очень сильны, не боялись смерти, всегда стремились к познанию неизведанных земель и их завоеванию. Торфинн — сын великого Торса, не был исключением. Слушая рассказы Лейфа Эрикссона, старого друга его отца, о великих сражениях и путешествиях родителя, мальчик мечтал"
        },
        {
            "id": 32,
            "titleEng": "Wonder Egg Priority",
            "titleRus": "Приоритет чудо-яйца",
            "dateRelease": "13.01.2021",
            "episodes": "12/12",
            "status": "Finished",
            "age": 18,
            "genres": ["Drama", "Casual", "Psychological", "Fantasy"],
            "poster": PosterWonderEgg,
            "bg": BgWonderEgg,
            "codec": "https://www.youtube.com/embed/qoB5pkEuPLc",
            "rate": 8.8,
            "descriptions": "Однажды ночью во время прогулки юная Ай Ото услышала таинственный голос: «Если хочешь изменить будущее, нужно сделать выбор. Поверь в себя... Разбей яйцо». Что ждёт Ай за разбитой скорлупой?"
        },
        ]

}

export default Constants;